[
  {
    "release_name": "2025.03.4",
    "new_features": [
      {
        "whats_new": "Added new testing features ClickHouse.",
        "impact": "Improves the testing process for analyzing cloud services.",
        "changes_description": "Implemented tests that run against ClickHouse Cloud to ensure compatibility and functionality.",
        "other_info": ""
      },
      {
        "whats_new": "Updated Docker publish usage.",
        "impact": "Simplifies the tagging process in Docker deployments.",
        "changes_description": "Now uses the Git tag name directly as the Docker tag, enhancing the deployment efficiency.",
        "other_info": ""
      }
    ],
    "bug_fixes": [
      {
        "whats_new": "Removed unnecessary migration flags.",
        "impact": "Reduces potential errors and improves system stability.",
        "changes_description": "The migration flags have been removed, simplifying the update process.",
        "other_info": ""
      },
      {
        "whats_new": "Removed redundant prefix from published images.",
        "impact": "Clears up naming conventions in published images.",
        "changes_description": "The 'tenzorzero-' prefix has been removed for better clarity.",
        "other_info": ""
      }
    ],
    "tests": [
      {
        "whats_new": "Run ClickHouse tests against ClickHouse Cloud.",
        "impact": "Validates cloud infrastructure compatibility and efficiency.",
        "changes_description": "These tests ensure the system works seamlessly with ClickHouse Cloud services.",
        "other_info": ""
      }
    ],
    "documentation": [],
    "others": [
      {
        "whats_new": "Updated dependencies, including the 'request' package.",
        "impact": "Enhances security and feature set of the application.",
        "changes_description": "Bumped the version of the 'request' dependency to the latest, improving overall performance and reliability.",
        "other_info": ""
      }
    ]
  },
  {
    "release_name": "2025.03.4",
    "new_features": [
      {
        "whats_new": "Updated documentation usage for Docker publishing.",
        "impact": "This change simplifies the tagging process by using the git tag name directly for Docker images, making it easier to manage versions.",
        "changes_description": "Now, the Docker publish uses non-SemVer tags directly as the git tag name will be used for Docker tagging.",
        "other_info": ""
      }
    ],
    "bug_fixes": [
      {
        "whats_new": "Removed migration flag that was no longer needed.",
        "impact": "This cleaning up helps streamline the code and potentially removes unnecessary complexity.",
        "changes_description": "The migration flag that was previously included has been removed, indicating that the migration process is complete or no longer required.",
        "other_info": ""
      },
      {
        "whats_new": "Adjusted ClickHouse tests and runtime to improve performance.",
        "impact": "This adjustment could lead to improved performance and reliability of ClickHouse's cloud features.",
        "changes_description": "Tests were run against ClickHouse Cloud, and adjustments were made to account for better runtime situations and concurrent processes.",
        "other_info": ""
      },
      {
        "whats_new": "Fixed issues with Docker image naming by removing a specific prefix.",
        "impact": "This change helps in simplifying the image naming conventions and reduces potential confusion.",
        "changes_description": "The prefix 'tenzorzero-' was removed from the published images, leading to a clearer naming scheme.",
        "other_info": ""
      }
    ],
    "tests": [
      {
        "whats_new": "Run ClickHouse tests against ClickHouse Cloud.",
        "impact": "Validates the implementation and helps ensure functionality within the cloud context.",
        "changes_description": "Running these tests ensures that the ClickHouse features are working effectively in the cloud environment.",
        "other_info": ""
      }
    ],
    "documentation": [
      {
        "whats_new": "Updated documentation regarding Docker publish usage.",
        "impact": "Documentation helps users understand the updated procedures better, encouraging proper usage of the features.",
        "changes_description": "Instructions on how to use Docker with the latest version have been clarified, providing better guidance to users.",
        "other_info": ""
      }
    ],
    "others": [
      {
        "whats_new": "Bump version to 2025.03.4 and minor version updates in dependencies.",
        "impact": "Keeping dependencies current ensures that the software remains secure and performs well.",
        "changes_description": "Versioning adjustments and minor updates in additional libraries were performed for overall improvement.",
        "other_info": ""
      }
    ]
  }
]
