[
  {
    "release_name": "v0.7.12",
    "new_features": [
      {
        "whats_new": "Game builder with Gemini added.",
        "impact": "Enhances the game development experience by integrating Gemini.",
        "changes_description": "A new game builder feature is now available that works with the Gemini agent.",
        "other_info": ""
      }
    ],
    "bug_fixes": [
      {
        "whats_new": "Tools added to Gemini agent.",
        "impact": "Improves usability and functionality of the Gemini agent.",
        "changes_description": "We've added useful tools to the Gemini agent to help users work more efficiently.",
        "other_info": ""
      },
      {
        "whats_new": "Fixed Enum key generator and validator.",
        "impact": "Ensures accurate key generation and validation processes.",
        "changes_description": "Issues with the Enum key generator and validator have been resolved for better performance.",
        "other_info": ""
      }
    ],
    "tests": [],
    "documentation": [],
    "others": []
  },
  {
    "release_name": "v0.7.12",
    "new_features": [
      {
        "whats_new": "Introduction of a new game building feature with Gemini agent support.",
        "impact": "This improvement allows users to create games more efficiently using the updated tools.",
        "changes_description": "Added tools that enhance the game-building experience.",
        "other_info": ""
      }
    ],
    "bug_fixes": [
      {
        "whats_new": "Fixed tool issues regarding the Gemini agent.",
        "impact": "Users can now use the Gemini agent tools without errors, improving overall functionality.",
        "changes_description": "Resolved bugs related to the Gemini agent tools, ensuring a smoother user experience.",
        "other_info": ""
      },
      {
        "whats_new": "Fixed issues in the menu key generator and validator.",
        "impact": " fix ensures that the key generator and validator work correctly, preventing potential errors in usage.",
        "changes_description": "Corrected the functionality of the enu key generator and validator to function as intended.",
        "other_info": ""
      }
    ],
    "tests": [],
    "documentation": [],
    "others": []
  }
]